#!/usr/bin/env  python
# -*-  coding:utf8  -*-

# 1.list列表
li = [12, 34, 'age', [22, 'ss'], 'asd', True]
# 列表中的元素可以是数字，字符串，列表，布尔值都可以放进去

# 2.索引取值
print(li[2])  # age
# 切片结果也是列表
print(li[2:4])  # ['age', [22, 'ss']]

for i in li:
    print(i)

# 3.列表可以被修改
li[1] = [11, 22, 33, 44]
print(li)  # [12, [11, 22, 33, 44], 'age', [22, 'ss'], 'asd', True]
li[2:4] = ['xx', 'yy']
print(li)  # [12, [11, 22, 33, 44], 'xx', 'yy', 'asd', True]
print('---------------------')

# 4.删除
del li[2]
print(li)  # [12, [11, 22, 33, 44], 'yy', 'asd', True]
del li[3:5]
print(li)  # [12, [11, 22, 33, 44], 'yy']

# 5.字符串转换成列表
st = 'deanywang'
li1 = list(st)
print(li1)  # ['d', 'e', 'a', 'n', 'y', 'w', 'a', 'n', 'g']

# 6.列表转换成字符串
li2 = [11, 22, 33, 'abc', 'ef']
s = ''
for m in li2:
    s += str(m)
print(s)  # 112233abcef

# 7.列表中只有字符串，直接使用join方法将列表转换成字符串
li3 = ['deany', 'wang']
s1 = ''.join(li3)
print(s1)  # deanywang

# 8.列表可以直接在原来值进行追加，直接将整个列表追加为一个元素
li3.append(888)
li3.append([11, 22])
print(li3)  # ['deany', 'wang', 888, [11, 22]]

# 9. 清空列表
li1.clear()
print('li1=', li1)  # li1= []

# 10. 复制,浅拷贝
s2 = li3.copy()
print(s2)

# 11.计算元素出现的个数
li4 = [11, 22, 33, 44, 11, 22]
s3 = li4.count(22)
print(s3)  # 2

# 12.列表元素追加到列表元素后面，注意与append追加方式不一样，extend是扩展源列表
# 如果extend一个字符串，则会把每个字符串拆分元素加入到列表中
li5 = [11, 22, 33, 44]
li5.extend([9898, '不得了'])
print(li5)  # [11, 22, 33, 44, 9898, '不得了']
li6 = [11, 22, 33, 44]
li6.extend("王某")
print(li6)  # [11, 22, 33, 44, '王', '某']

# 13.查找列表元素索引值,没有这个元素的话会报错
li7 = [11, 22, 33, 44, 22, 44]
s7 = li7.index(33)  # 可以指定列表首位位置li7.index(33，2，5)，不加首位位置只查找元素第一次出现的索引值
print(s7)  # 2

# 14.指定索引位置插入元素值
li8 = ['ww', 1, 2, 3, 45, 66]
li8.insert(0, 1)
print(li8)  # [1, 'ww', 1, 2, 3, 45, 66]

# 15.默认删除列表某个值,并且把这个值获取出来
li9 = [11, 22, 33, 44, 55]
s9 = li9.pop()  # 默认删除列表最后一个值，li9.pop(2)加上索引指定位置删除索引所在的元素
print(li9)  # [11, 22, 33, 44]
print(s9)  # 55

# 16.删除列表中的指定值
li10 = [11, 22, 33, 44, 55, 33]
li10.remove(33)  # 默认优先删除最前面的这个值，只删除一个值
print(li10)  # [11, 22, 44, 55, 33]

# 17.列表数值反转
li11 = [11, 22, 33, 44, 55, 33]
li11.reverse()
print(li11)  # [33, 55, 44, 33, 22, 11]

# 18.列表数值排序
li12 = [11, 33, 44, 55, 8, 11, 33]
li12.sort()  # 默认从小到大排序，li12.sort(reverse=True)则是从大到小排序
print(li12)  # [8, 11, 11, 33, 33, 44, 55]
li12.sort(reverse=True)
print(li12)  # [55, 44, 33, 33, 11, 11, 8]

